Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་དགའ་བ་གང་ཞེ་ན། གང་དགེ་བའི་ཆོས་རྣམས་དྲན་པ་དང་། རྗེས་སུ་དྲན་པ་དང་། དགའ་བ་དང་། དད་པ་དང་། རབ་ཏུ་དགའ་བ་དང་། དགེ་བའི་ཆོས་ལ་མི་ཞུམ་པ་དང་། མི་འགོང་བ་དང་། ཡོངས་སུ་མི་སྐྱོ་བ་དང་། མི་དགའ་བ་ཐམས་ཅད་སྤོང་བ་དང་། ཆོས་ཐམས་ཅད་ལ་དགའ་བར་གནས་པ་དང་། སེམས་རབ་ཏུ་དགའ་བ་དང་། ལུས་རབ་ཏུ་སིམ་པ་དང་། བློ་རབ་ཏུ་དགའ་བ་དང་། ཡིད་རབ་ཏུ་མགུ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་མངོན་པར་དགའ་ཞིང་མོས་པ་དང་། མཚན་དང་། དཔེ་བྱད་བཟང་པོའི་རྒྱན་ཀུན་ཏུ་ཚོལ་བ་ལ་དགའ་བ་དང་། ཆོས་ཉན་པས་ཡོངས་སུ་མི་སྐྱོ་ཞིང་དགའ་བ་དང་། ཆོས་ཀྱི་ཕྱིར་འབྲང་བའི་ནན་ཏན་ལ་རབ་ཏུ་དགའ་བ་དང་། རབ་ཏུ་དགའ་བའི་ཆོས་ལ་མགུ་བ་དང་། སེམས་ཅན་རྣམས་ལ་ཁོང་ཁྲོ་བ་མེད་པ་དང་། བྱང་ཆུབ་ལ་དགའ་བ་དང་། ཆོས་རྒྱ་ཆེན་པོ་ལ་མོས་པ་དང་། ཉི་ཚེ་བའི་ཐེག་པ་སེལ་བར་སེམས་བསྐྱེད་པ་དང་། སེར་སྣ་ཚར་གཅོད་པ་དང་། སློང་བ་ལ་དགའ་བ་དང་། གཏོང་བ་ལ་རབ་ཏུ་དགའ་བ་དང་། ཚུལ་ཁྲིམས་འཆལ་པ་དག་སྡུད་ཅིང་བྱམས་པ་དང་། ཚུལ་ཁྲིམས་དང་ལྡན་པ་ལ་རྟག་ཏུ་དད་པ་དང་། བདག་གི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པས་ངན་འགྲོ་དང་། འཇིགས་པ་ཐམས་ཅད་ལས་རབ་ཏུ་འདའ་བར་དབུགས་འབྱིན་པ་ལ་རབ་ཏུ་དགའ་བ་དང་། ཕ་རོལ་ངན་དུ་ཟེར་བ་དང་། ངན་པར་བརྗོད་པའི་ཚིག་གི་ལམ་བཟོད་ཅིང་རབ་ཏུ་དགའ་བ་དང་། ལག་པ་དང་། རྐང་པ་དང་། མིག་དང་མགོ་བཅད་ཀྱང་བཟོད་པར་ནུས་ཏེ སེམས་མི་ཉམས་ཤིང་རབ་ཏུ་དགའ་བ་དང་། རྒན་རབས་ལ་འདུད་ཅིང་ཞེས་བྱེད་པ་ལ་དགའ་བ་དང་། རྟག་ཏུ་བཞིན་འཛུམ་པ་ལ་དགའ་བ་དང་། ཁྲོ་གཉེར་མེད་ཅིང་གསོང་པོར་སྨྲ་བ་ལ་དགའ་བ་དང་། ཚུལ་འཆོས་པ་དང་། ཁ་གསག་དང་། གཞོགས་སློང་མེད་པ་ལ་རབ་ཏུ་དགའ་བ་དང་། སྙིང་པོ་དང་ལྡན་པའི་ཆོས་ལ་འཇུག་པར་རབ་ཏུ་དགའ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལ་སྟོན་པ་བཞིན་དུ་ཕངས་པ་དང་། ཆོས་ལ་བདག་བཞིན་དུ་ཕངས་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་སྲོག་བཞིན་དུ་ཕངས་པ་དང་བླ་མ་ལ་ཕ་མ་བཞིན་དུ་ཕངས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བུ་བཞིན་དུ་ཕངས་པ་དང་། སློབ་དཔོན་ལ་མིག་བཞིན་དུ་ཕངས་པ་དང་། ནན་ཏན་ལ་ཡན་ལག་གི་དམ་པ་མགོ་བཞིན་དུ་ཕངས་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ལག་པ་དང་། རྐང་པ་བཞིན་དུ་ཕངས་པ་དང་། ཆོས་སྨྲ་བ་ལ་རིན་པོ་ཆེ་ཐམས་ཅད་བཞིན་དུ་ཕངས་པ་དང་། ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་སྨན་བཞིན་དུ་ཕངས་པ་དང་། སྐུལ་ཞིང་དྲན་པར་བྱེད་པ་ལ་སྨན་པ་བཞིན་དུ་ཕངས་པར་སེམས་པའོ། །
en: “ ‘What is the empathetic joy of the bodhisatvas like? It is to be mindful and attentive, glad, and enthusiastic, and to take joy in wholesome conduct. It is to not be discouraged, to be undaunted and unwearied, and to rid oneself of any dissatisfaction in relation to all wholesome forms of conduct. It is to engage joyously with all things and to have a joyous mind, a satisfied body, a stimulated intellect, and elated thoughts. It is to applaud and delight in the body of the Tathāgata. It is to delight in the search for the splendor of major characteristics and minor marks. It is to delight in the Dharma and not become weary when listening to it. It is to delight in the progress that is made by following the Dharma. It is to be elated by the joy of the Dharma. It is to be without anger toward sentient beings. It is to take joy in awakening and to feel inclined toward the illustrious teachings. It is to have a motivation that is removed from that of the limited vehicle. It is to have defeated miserliness. It is to be joyful toward those in need. It is to take joy in renunciation. It is to be kind and affectionate toward those who are immoral. It is to always appreciate those who uphold good moral conduct. It is to keep one’s moral conduct pure, and to delight in the fact that this alleviates and frees one from all the fears of the lower realms. It is to rejoice and be patient with others when confronted with insults and offensive language. It is to remain joyously undisturbed and patiently bear it when one’s hands, feet, eyes, and head are being cut to pieces. It is to joyfully have reverence for one’s teachers. It is to joyfully bow to and venerate one’s superiors. It is to always have a joyful smiling demeanor toward those in need. It is to joyfully keep a nonaggressive demeanor when one engages in conversation with interest. It is to rejoice in the absence of hypocrisy, manipulation, and extortion. It is to rejoice when there is a connection with the essential Dharma. “ ‘It is to be just as fond of the bodhisatvas as one is of one’s mentor. It is to be just as fond of the teachings as one is of oneself. It is to be just as fond of the tathāgatas as one is of one’s own life. It is to be just as fond of the teachers as one is of one’s parents. It is to be just as fond of all sentient beings as one is of one’s own child. It is to be just as fond of the masters as one is of one’s own eyes. It is to be just as fond of spiritual progress as one is of one’s own head. It is to be just as fond of the perfections as one is of one’s hands and feet. It is to be just as fond of those who preach the Dharma as one is of all one’s riches. It is to be just as fond of seeking the Dharma as one is of medicine. It is to be just as fond of encouragement and reminders as one is of a doctor.

source: གཞོན་ནུ་འདི་ནི་དགའ་བ་ཞེས་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགའ་བ་དེ་ལ་རབ་ཏུ་གནས་ནས་རྟག་ཏུ་ཆོས་ཚོལ་བ་ལ་དགའ་བར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ལ་མི་སྐྱོའོ། །
en: “ ‘This, young prince, is what is called empathetic joy. The bodhisatvas, the great beings, who have this kind of stable empathetic joy always take great delight in searching for the Dharma. They do not weary of following the training in the bodhisatva’s way of life.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བཏང་སྙོམས་གང་ཞེ་ན། བཏང་སྙོམས་རྣམ་པ་གསུམ་སྟེ། རྣམ་པ་གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཉོན་མོངས་པ་ལ་བཏང་སྙོམས་པ་དང་། བདག་དང་གཞན་རྗེས་སུ་སྲུང་བའི་བཏང་སྙོམས་པ་དང་། དུས་དང་དུས་མ་ཡིན་པར་བཏང་སྙོམས་པའོ། །
en: “ ‘What is the equanimity of the bodhisatvas like? There are three aspects of equanimity. What are they? They are equanimity in the face of afflictive emotions, equanimity with regard to concern for oneself versus others, and remaining equanimous when it is called for.

source: དེ་ལ་ཉོན་མོངས་པའི་བཏང་སྙོམས་པ་གང་ཞེ་ན། གང་བཀུར་སྟི་བྱས་ཀྱང་མཐོར་མི་སེམས་པ་དང་། བཀུར་སྟི་མ་བྱས་ཀྱང་དམའ་བར་མི་སེམས་པ་དང་། རྙེད་པས་སྙེམས་པ་མེད་པ་དང་། མ་རྙེད་པས་ཡི་མི་འཆད་པ་དང་། ཚུལ་ཁྲིམས་དང་ལྡན་པ་དང་། ཚུལ་ཁྲིམས་འཆལ་པ་ལ་བློ་མཉམ་པ་དང་། གྲགས་པ་ལ་དགའ་བ་མེད་པ་དང་། མ་གྲགས་པ་ལ་ཞུམ་པ་མེད་པ་དང་། སྨད་པ་ལ་ཡི་མི་གསོད་པ་དང་། བསྟོད་པ་ལ་ཆོས་ཉིད་དུ་ཤིན་ཏུ་གནས་པ་དང་། སྡུག་བསྔལ་ལ་སོ་སོར་རྟོག་པའི་སྟོབས་དང་། བདེ་བ་ལ་མི་རྟག་པར་རྟོག་པའི་སྟོབས་དང་། རྗེས་སུ་ཆགས་པ་འདོར་བ་དང་། ཁོང་ཁྲོ་བ་སྤོང་བ་དང་། མཛའ་བ་དང་མི་མཛའ་བ་ལ་སེམས་མཉམ་པ་དང་། ལེགས་པར་བྱས་པ་དང་། ཉེས་པར་བྱས་པ་ལ་གཉིས་སུ་མི་འབྱེད་པ་དང་། སྡུག་པ་དང་མི་སྡུག་པ་ལ་མི་ལྟ་བ་དང་། བསྙེན་བཀུར་བྱེད་པ་དང་། བསྙེན་བཀུར་མི་བྱེད་པ་ལ་དགའ་བ་དང་མི་དགའ་བར་བྱ་བ་མེད་པ་དང་། སྙན་པར་སྨྲ་བ་དང་། མི་སྙན་པར་སྨྲ་བ་ལ་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་མེད་པ་དང་། ཀུན་མྱང་བའི་ཉེས་པ་ལ་མཚུངས་པར་ཡོངས་སུ་འཇལ་བ་དང་། བདག་དང་སེམས་ཅན་གཞན་ལ་བསམ་པ་མཉམ་པ་དང་། ལུས་དང་སྲོག་ལ་མི་ལྟ་བ་དང་། སེམས་ཅན་རབ་འབྲིང་ཐ་མ་ལ་འོད་ཟེར་མཉམ་པ་དང་། བསྔགས་པ་དང་མ་བསྔགས་པ་ལ་ཆོས་ཉིད་མཉམ་པ་དང་། བདེན་པ་དང་། མི་བདེན་པ་ལ་བདག་གི་བདེན་པ་ཡོངས་སུ་དག་པ་སྟེ། གཞོན་ནུ་འདི་ལྟར་གང་བདག་ལ་གནོད་པར་བྱེད་པ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་བཏང་སྙོམས་པ་ཡིན་ནོ། །
en: “ ‘What is equanimity in the face of afflictive emotions? It is to remain unexcited when one is praised and not become depressed when one is criticized. It is to not become complacent concerning one’s possessions and not become upset when one is unable to acquire new things. It is to be equanimous with respect to those who are moral and those who are immoral. It is to not be overly fond of fame and not be discouraged when one is disgraced. It is to not let oneself be hurt by blame and to be realistic when receiving approval. It is the ability to relate to pain and the ability to keep in mind that happiness is temporary. It is to abandon attachment and to shun anger. It is to think of friends and foes as equal. It is to not consider good and bad actions as different. It is to not discriminate between dear ones and enemies. It is to not give different recognition to those who are articulate and those who are not. It is to not give different recognition to those who are attentive and those who are not. It is to not be attached to pleasant speech and not become angry at unpleasant speech. It is to endure pleasure and pain equally. It is to have the same care for other sentient beings as for oneself. It is to have no concern for one’s body or one’s life. It is to have the same respect for beings who are lower, higher, or in between. It is to consider those with status and those without status as equal by nature. It is to maintain one’s own true purity when faced with truth and falsehood. In this way, young prince, the bodhisatva remains equanimous when faced with challenges.

source: དེ་ལ་བདག་དང་གཞན་རྗེས་སུ་སྲུང་བའི་བཏང་སྙོམས་གང་ཞེ་ན། གང་ཡན་ལག་དང་ཉིང་ལག་གི་ཤ་བཅད་ཀྱང་བཏང་སྙོམས་པ་ཡིན་ནོ། ། ཡན་ལག་དང་ཉིང་ལག་གི་ཤ་བཅད་ཀྱང་། འདོད་པ་མེད་ཅིང་ཚོལ་བ་མེད་དེ་བཏང་སྙོམས་པ་ཡིན་ནོ། ། ལུས་ཀྱང་མི་འགྱུར། ངག་ཀྱང་མི་འགྱུར་ཏེ། གཉི་ག་བཟོད་པས་དེའི་ཕྱིར་བཏང་སྙོམས་ཞེས་བྱའོ། ། མིག་གི་རྣམ་པས་མ་ཡིན། གཟུགས་ཀྱི་རྣམ་པས་མ་ཡིན་ཏེ། གཉི་གས་ཀྱང་རྨ་མི་ཕྱིན་པ་ནས། ཡིད་ཀྱི་རྣམ་པ་དང་། ཆོས་ཀྱི་རྣམ་པའི་བར་གྱིས་རྨ་མི་ཕྱིན་པས་དེའི་ཕྱིར་བཏང་སྙོམས་ཞེས་བྱའོ། ། རྨ་མི་ཕྱིན་ཅིང་སྣང་བ་མེད་པས་དེའི་ཕྱིར་བཏང་སྙོམས་ཞེས་བྱའོ། ། རྨ་ཕྱུང་བ་ལ་རྨ་མི་འབྱིན་པས་དེའི་ཕྱིར་བཏང་སྙོམས་ཞེས་བྱའོ། ། བདག་དང་ཕ་རོལ་གཉི་ག་ལས་བཟོད་པས་དེའི་ཕྱིར་བཏང་སྙོམས་ཞེས་བྱའོ། ། ཕན་པར་བྱེད་པ་དང་། ཕན་པར་མི་བྱེད་པ་ལ་མཉམ་པར་སྦྱོར་བས་དེའི་ཕྱིར་བཏང་སྙོམས་ཞེས་བྱའོ། ། བཏང་སྙོམས་ནི་རྩོད་པ་མེད་པ་ལྷུར་བྱེད་པའོ། ། བཏང་སྙོམས་ནི་རང་གི་སེམས་ངེས་པར་རྟོག་པའོ། ། བཏང་སྙོམས་ནི་བདག་ལ་སོ་སོར་རྟོག་པའོ། ། བཏང་སྙོམས་ནི་གཞན་ལ་གནོད་པ་མེད་པའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བཏང་སྙོམས་ནི་མཉམ་པར་གཞག་པའི་དངོས་པོ་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་བཏང་སྙོམས་པ་གནང་བར་མི་མཛད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔས་རྟག་ཏུ་འབད་པར་བྱའོ། ། རྟག་པར་རྒྱུན་མི་འཆད་པར་དགེ་བ་ཡོངས་སུ་བཙལ་བ་ལ་བརྩོན་པར་བྱ་སྟེ། དུས་དུས་སུ་བཏང་སྙོམས་བསྒོམ་པར་བྱའོ། །
en: “ ‘What is equanimity with regard to concern for self versus others? It is to remain equanimous when the flesh of one’s major and minor limbs is being chopped off. It is to not wish for or chase after experience when having the flesh of one’s major and minor limbs chopped off, but to remain in equanimity. What is meant by equanimity is being patient in two ways: to adjust one’s body and to adjust one’s speech to any situation. What is meant by equanimity is not sustaining the two wounds, not letting oneself be wounded with respect to the eye or with respect to form, and so forth, and not letting oneself be wounded with respect to the intellect or with respect to mental phenomena. What is meant by equanimity is not being wounded or hurt. What is meant by equanimity is not being affected when one is wounded. What is meant by equanimity is the twofold patience: with oneself and with others. What is meant by equanimity is relating to those who are helpful and to those who are not in the same way. Equanimity is the supreme way to avoid disputes. Equanimity is to comprehend one’s own mind. Equanimity is to analyze the self. Equanimity is to not hurt anyone. The equanimity of the bodhisatvas is to keep a concentrated focus. For the lords, the buddhas, however, the equanimity of the bodhisatvas, the great beings, is not acceptable. Why is that? It is because the bodhisatva keeps himself perpetually engaged and occupied, always concerned with his search for the wholesome, and he will engage in the practice of equanimity only when it is called for.

source: དེ་ལ་དུས་དུས་སུ་བཏང་སྙོམས་བསྒོམ་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྣོད་མ་ཡིན་པའི་སེམས་ཅན་ལ་བཏང་སྙོམས་པ་དང་། བསྙེན་བཀུར་མི་བྱེད་པ་ལ་བཏང་སྙོམས་པ་དང་། མ་རྙེད་པ་དང་། སྨད་པ་དང་། མ་གྲགས་པ་དང་། སྡུག་བསྔལ་བ་ལ་བཏང་སྙོམས་པ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པར་ངེས་པར་འགྱུར་བ་ལ་ཞུགས་པ་རྣམས་ལ་བཏང་སྙོམས་པ་དང་། སྦྱིན་པའི་དུས་ན་ཚུལ་ཁྲིམས་ཉེ་བར་བསྒྲུབ་པ་བཏང་སྙོམས་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་དུས་ན་སྦྱིན་པ་ཉེ་བར་བསྒྲུབ་པ་བཏང་སྙོམས་པ་དང་། བཟོད་པའི་དུས་ན་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བརྩོན་འགྲུས་ཉེ་བར་བསྒྲུབ་པ་བཏང་སྙོམས་པ་དང་། བརྩོན་འགྲུས་ཀྱི་དུས་ན་ཚུལ་ཁྲིམས་ཀྱི་རྗེས་སུ་འཇུག་པ་བཏང་སྙོམས་པ་དང་། བསམ་གཏན་གྱི་དུས་ན་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉེ་བར་བསྒྲུབ་པ་བཏང་སྙོམས་པ་དང་། ཤེས་རབ་དུས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་ལ་དམིགས་པ་ཉེ་བར་བསྒྲུབ་པ་བཏང་སྙོམས་པ་སྟེ།
en: “ ‘What does it mean to practice equanimity when it is called for? It is to be unconcerned with sentient beings who are not suitable vessels. It is to be unconcerned with those who do not have the proper kind of engagement. It is to be unconcerned when faced with loss, blame, disgrace, and pain. It is to be unconcerned with those whose destiny it is to follow the Śrāvakayāna. It is to be unconcerned with upholding morality when one is being generous. It is to be unconcerned with being generous when one upholds morality. It is to be unconcerned with being generous, moral, or vigorous when one is practicing patient acceptance. It is to be unconcerned with practicing morality when one is being vigorous. It is to be unconcerned with perfecting generosity when one is practicing meditation. It is to be unconcerned with keeping a focus on the five perfections when one is applying wisdom. This is what practicing equanimity when it is called for means.

source: འདི་ནི་དུས་དུས་སུ་བཏང་སྙོམས་པ་ཞེས་བྱའོ། ། དེ་ལྟར་གང་མི་བྱ་བའི་ཆོས་མི་བྱེད་པ་འདི་ནི་བཏང་སྙོམས་ཞེས་བྱ་སྟེ། དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མི་དགེ་བའི་ཕྱོགས་ཐམས་ཅད་ལ་བཏང་སྙོམས་སུ་བྱེད་དོ། །
en: “ ‘Thus, what is meant by equanimity is remaining uninvolved with the phenomena that one should not get involved with. The bodhisatva, the great being, practices equanimity toward all unwholesome things, with this firm foundation.

source: གཞོན་ནུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ཞེས་བྱའོ། །
en: “ ‘This then, young prince, is what is known as the love, compassion, empathetic joy, and equanimity that the bodhisatvas, the great beings, have when they relate to all sentient beings.’

source: དེ་ལྟར་ཤཱ་རིའི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཕུང་པོ་ཆེན་པོ་དེས་གཞོན་ནུ་བརྩོན་འགྲུས་སྤྱོད་ལ་བྱམས་པ་དང་། སྙིང་རྗེ་དང་དགའ་བ་དང་། བཏང་སྙོམས་མདོར་བསྟན་པ་དང་བཅས། རྒྱས་པར་བསྟན་པ་དང་བཅས་ཏེ། རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་ཏོ། ། གཞོན་ནུ་བརྩོན་འགྲུས་སྤྱོད་དེས་དེ་ཐོས་ནས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་འགྲུས་བརྩམས་པར་གྱུར་ཏོ། །
en: “In this way, Śāriputra, the Lord, the Tathāgata Mahāskandha, explained love, compassion, empathetic joy, and equanimity in great detail to the diligent young prince. He explained the six perfections using descriptions and illustrations. What are these six perfections? They are the perfection of generosity, the perfection of morality, the perfection of patient acceptance, the perfection of vigor, the perfection of meditation, and the perfection of wisdom, and he explained them in great detail using descriptions and illustrations. When he had heard all this, the diligent young prince began to exert himself in the perfections.”

source: བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ཀྱི་ལེའུ་སྟེ་ལྔ་པའོ།། །།
en: This is the fifth chapter, “Love, Compassion, Empathetic Joy, and Equanimity.”

source: དེ་ལ་ཤཱ་རིའི་བུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་བརྩོན་པ་གང་ཞེ་ན། ཤཱ་རིའི་བུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ཉིད་ཡིན་ཏེ། གང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ལ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དོ། ། དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། དེ་དག་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་རྣམས་སོ། །
en: “Now, Śāriputra, how does one practice the perfections? Śāriputra, there are six perfections that bodhisatvas engage in when they practice the bodhisatva path. What are these six perfections? They are the perfection of generosity, the perfection of morality, the perfection of patient acceptance, the perfection of vigor, the perfection of meditation, and the perfection of wisdom.

source: དེ་ལ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན། ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། ཕོངས་པ་རྣམས་ཀྱི་སྦྱིན་བདག་ཡིན་ཏེ། འདི་ལྟ་སྟེ། ཟས་ཀྱིས་ཕོངས་པ་ལ་ཟས། སྐོམ་གྱིས་ཕོངས་པ་ལ་སྐོམ། བཞོན་པ་དང་། གོས་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། གནས་དང་། ཡོ་བྱད་དང་། ན་བའི་གསོས་སྨན་དང་། མར་མེ་དང་། སིལ་སྙན་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། །བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་དང་། རྟ་དང་། གླང་པོ་ཆེ་དང་། ཤིང་རྟ་དང་། སྐྱེད་མོས་ཚལ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དང་། བུ་དང་། བུ་མོ་དང་། ཆུང་མ་དང་། ནོར་དང་། འབྲུ་དང་། མཛོད་དང་། བང་བ་དང་། གླིང་བཞིའི་རྒྱལ་པོའི་ལོངས་སྤྱོད་ཀྱི་བདེ་བ་ཐམས་ཅད་དང་། རྩེ་བ་དང་། དགའ་བ་ཐམས་ཅད་དང་། ལག་པ་དང་། རྐང་པ་དང་། རྣ་བ་དང་། སྣ་དང་། མིག་དང་། མགོ་དང་། ཤ་དང་། ཁྲག་དང་། རྐང་དང་། རུས་པ་དང་། འཇིག་རྟེན་གྱི་ཡོ་བྱད་གང་ཡང་སློང་བ་ལ་ཡོངས་སུ་མི་གཏོང་བ་མེད་དོ། །
en: “What is the perfection of generosity? Śāriputra, the bodhisatva gives support to ascetics, brahmins, and the wretched. He gives food to those in need of food, drink to those in need of drink. He gives vehicles, clothes, fragrance, garlands, ointments, shelter, utensils, medicine for the sick, light, music, male and female servants, gold, jewels, pearls, gems, conches, crystals, and coral. He gives horses, elephants, chariots, parks, hermitages, sons, daughters, wives, treasure, grain, stocks, storerooms, and all the pleasures enjoyed by the kings of the four continents. He gives all his joys and amusements, and he gives his hands, feet, ears, nose, eyes, head, flesh, blood, marrow, and bone. There is not a single worldly object that he will not part with for those in need.

source: སྦྱིན་པ་དེ་རྣམ་པ་བཅུས་ཡོངས་སུ་དག་པར་སྦྱིན་པར་བྱེད་དེ། བཅུ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་མི་འཐུན་པའི་ལོངས་སྤྱོད་ཡོངས་སུ་ཚོལ་ཞིང་སྦྱིན་པ་མེད། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སེམས་ཅན་ལ་གནོད་པའི་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་འཇིགས་ཤིང་སྐྲག་ནས་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཡོངས་སུ་མ་བཏང་བ་ལ་འགྲོན་དུ་གཉེར་བའི་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདོང་དུ་ལྟ་ཞིང་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སེམས་ཅན་ལ་ཐ་དད་པར་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་མཛའ་བས་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སྡང་བས་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཞིང་ཚོལ་ཞིང་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སེམས་ཅན་ཐམས་ཅད་ལ་སྦྱིན་གནས་མ་ཡིན་ཞེས་བརྙས་ཤིང་སྦྱིན་པ་མེད་དེ།
en: “He gives that gift as purified because of ten features. What are they? The bodhisatvas’ generosity does not provide for inappropriate pleasures. The bodhisatvas’ generosity does not inflict harm on sentient beings. The bodhisatvas’ generosity does not come from intimidation or fear. The bodhisatvas’ generosity does not discourage renunciation. The bodhisatvas’ generosity is not superficial. The bodhisatvas’ generosity does not discriminate between sentient beings. The bodhisatvas’ generosity is not a gesture of flattery. The bodhisatvas’ generosity is not a gesture of animosity. The bodhisatvas’ generosity is not a means to acquire land. The bodhisatvas’ generosity does not involve denigrating sentient beings, thinking that they are unworthy recipients. These, Śāriputra, are the ten features by means of which the bodhisatva gives that purified gift.

source: ཤ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་དེ་རྣམ་པ་དེ་བཅུས་ཡོངས་སུ་དག་པར་སྦྱིན་པར་བྱེད་དོ། ། གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་དེ་གཞན་རྣམ་པ་བཅུས་ཡོངས་སུ་དག་པར་སྦྱིན་པར་བྱེད་དེ། བཅུ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་འདོད་ཅིང་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བསམ་པ་ལོག་པར་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཡོངས་སུ་སྐྱོ་བའི་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཉེ་བར་བསྟན་ནས་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་རྗེས་སུ་མི་དགའ་བའི་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་འགྱོད་པའི་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ལ་བཀུར་ཏེ་སྦྱིན་པ་མེད། ཚུལ་ཁྲིམས་འཆལ་པ་ལ་བརྙས་ཏེ་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་རྣམ་པར་སྨིན་པ་རེ་བའི་སྦྱིན་པ་མེད་དེ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་དེ་རྣམ་པ་དེ་བཅུས་ཡོངས་སུ་དག་པར་སྦྱིན་པར་བྱེད་དོ། །
en: “Śāriputra, he gives that gift as purified because of ten features. What are they? The bodhisatvas are not generous because they wish to ripen the fruits of their actions. The bodhisatvas are not generous with improper motives. The bodhisatvas are not generous without the proper resolve. The bodhisatvas do not become exhausted by being generous. The bodhisatvas are not generous because they are encouraged to be. The bodhisatvas do not regret their generosity. The bodhisatvas are not sorry for their generosity. The bodhisatvas are not generous as a way to honor those who uphold morality. The bodhisatvas are not generous as a way to chastise those who behave badly. The bodhisatvas are not generous because they wish to obtain something. These, Śāriputra, are the ten features by means of which the bodhisatva gives that purified gift.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་དེ་གཞན་རྣམ་པ་བཅུས་ཡོངས་སུ་དག་པར་སྦྱིན་པར་བྱེད་དེ། བཅུ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སྨད་ནས་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གཞན་དུ་ཕྱོགས་ནས་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཉོན་མོངས་ཤིང་སྦྱིན་པ་མེད། ཁྲོ་བ་དང་། ཕྲག་དོག་དང་། གནོད་སེམས་སྟོན་ཅིང་སྦྱིན་པ་མེད། རི་མོར་མི་བྱེད་པར་སྦྱིན་པ་མེད། རང་གི་ལག་ནས་མ་ཡིན་པར་སྦྱིན་པ་མེད། ཅི་ཙམ་དཔགས་པ་ལས་དབྲི་ཞིང་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྐྱེ་བ་འདོད་ཅིང་སྦྱིན་པ་མེད་དེ།
en: “Śāriputra, he gives that gift as purified because of ten features. What are they? The bodhisatvas do not give reproachfully. The bodhisatvas do not give with their faces averted. The bodhisatvas do not give in distress. They do not express anger, envy, or malice when they give. They do not give without veneration. They do not avoid giving personally. They do not give less than is appropriate. The bodhisatvas do not give with a desire that anything in particular will occur. These, Śāriputra, are the ten features by means of which the bodhisatva gives that purified gift.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་དེ་རྣམ་པ་དེ་བཅུས་ཡོངས་སུ་དག་པར་སྦྱིན་པར་བྱེད་དོ། ། གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་དེ་གཞན་རྣམ་པ་བཅུས་ཡོངས་སུ་དག་པར་སྦྱིན་པར་བྱེད་དེ། བཅུ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་མི་བརྟན་པར་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཚོད་འཛིན་ཅིང་སྦྱིན་པ་མེད། ཡོངས་སུ་ཆད་པར་སྦྱིན་པ་མེད། གཞན་གྱི་དྲིང་འཇོག་སྟེ་སྦྱིན་པ་མེད། ཉུང་ཞེས་ཅུང་ཟད་ཙམ་སྦྱིན་པ་མེད། གཟུགས་དང་། ལོངས་སྤྱོད་དང་། དབང་ཕྱུག་ལ་མངོན་པར་དགའ་བའི་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ལྷར་སྐྱེ་བ་ཐམས་ཅད་འདོད་པའི་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་བསྔོ་ཞིང་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་མཁས་པས་སྨད་པའི་སྦྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཐམས་ཅད་མཁྱེན་པར་མ་བསྔོས་པའི་སྦྱིན་པ་མེད་དེ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་དེ་རྣམ་པ་དེ་བཅུས་ཡོངས་སུ་དག་པར་སྦྱིན་པར་བྱེད་དོ། །
en: “Śāriputra, he gives that gift as purified because of ten features. What are they? There is no bodhisatvas’ generosity that is not firm. There is no bodhisatvas’ generosity that is already included. The bodhisatvas’ generosity is not broken. It is not a generosity that is reliant on others. It is not a generosity that is less than what would be considered little. It is not a generosity that delights in the physical, in pleasure, or in power. The bodhisatvas are not generous out of a longing to be born as any of the gods, as Śakra, Brahmā, or a protector of the world. The bodhisatvas do not aspire to generosity at the level of a śrāvaka or a pratyekabuddha. The bodhisatvas’ generosity is not despised by the learned. There is no bodhisatvas’ generosity that is not dedicated to omniscience. These, Śāriputra, are the ten features by means of which the bodhisatva gives that purified gift.
